Данный проект предусматривает собой создание драйвера для операционной системы Windows и графической оболочки, для работы с ним (графический интерфейс).
Назначение драйвера - возможность запрещать пользователю просматривать данные (файлы) с жесткого диска.
Основные функции:
1.	Установка драйвера
2.	Запуск драйвера
3.	Возможность управлять драйвером, через интерфейс
  a.	Установка связи графического интерфейса с драйвером (загрузка и выгрузка драйвера)
  b.	Запрещать пользователю просматривать определенные файлы и папки (накладывать фильтры)
  c.	Сохранение вводимых фильтров, список пользовательских фильтров
  d.  Снятие ограничения на фильтрацию выводимых данных

